export const ruTextsTermsOfService = [
  {
    text: `
  1. Используя Inctagram (далее Приложение), вы соглашаетесь соблюдать и подчиняться настоящим Условиям использования. Если вы не согласны с этими условиями, пожалуйста, не используйте Приложение.
`,
  },
  {
    text: `2. Право на использование Приложения:
  Для использования Приложения вы должны быть не моложе 13 лет. Используя Приложение, вы подтверждаете и гарантируете, что cоответствуйте этому требованию.
`,
  },
  {
    text: `
3. Учетные записи пользователей:
  Вы несете ответственность за обеспечение конфиденциальности учетных данных вашей учетной записи Instagram. Вы не можете делиться учетными данными Inctagram с другими или разрешать другим использовать вашу учетную запись. Вы несете ответственность за все действия, совершенные с использованием вашей учетной записи Inctagram.
`,
  },
  {
    text: `
4. Пользовательский контент:
  Вы несете полную ответственность за контент, который вы публикуете в Inctagram. Не размещайте контент, который является незаконным, агрессивным, домогательным, клеветническим или иным образом недопустимым. Вы предоставляете нам неисключительную, передаваемую, сублицензируемую, безвозмездную, мировую лицензию на использование вашего контента в связи с работой Instagram. Мы оставляем за собой право удалить или отключить любой контент, который нарушает настоящие условия.
`,
  },
  {
    text: `
5. Конфиденциальность и сбор данных:
  Наша Политика конфиденциальности, доступная по [ссылке на Политику конфиденциальности Inctagram], объясняет, как мы собираем, используем и защищаем ваши данные. Используя Instagram, вы соглашаетесь с условиями Политики конфиденциальности.
`,
  },
  {
    text: `
6. Поведение пользователей:
  Вы соглашаетесь не совершать действий, мешающих нормальной работе Inctagram или опыту других пользователей. Не используйте Inctagram для незаконных целей.
`,
  },
  {
    text: `
7. Меры безопасности:
  Мы предоставляем механизмы для сообщения о недопустимом контенте или поведении пользователей. Вы можете блокировать или сообщать о других пользователях Inctagram по мере необходимости для обеспечения вашего безопасного опыта.
`,
  },
  {
    text: `
8. Коммуникационные функции:
  Используйте коммуникационные функции Inctagram ответственно и уважайте права и конфиденциальность других пользователей. Не совершайте спам, домогательства или преследования в Inctagram.
`,
  },
  {
    text: `
9. Ссылки на сторонние ресурсы и сервисы:
  Inctagram может содержать ссылки на сторонние веб-сайты или сервисы. Inctagram не несет ответственности за содержание или практики этих внешних ресурсов или сервисов.
`,
  },
  {
    text: `
10. Интеллектуальная собственность:
  Весь контент и товарные знаки на Inctagram являются собственностью Inctagram. Если вы считаете, что ваше авторское право нарушено, пожалуйста, следуйте Политике по борьбе с нарушениями авторских прав Inctagram.
`,
  },
  {
    text: `
11. Отказ от гарантий:
  Inctagram предоставляется как есть без каких-либо гарантий. Inctagram не несет ответственности за прерывания, ошибки или упущения на платформе.
`,
  },
  {
    text: `
12. Прекращение использования:
  Inctagram оставляет за собой право прекратить или приостановить вашу учетную запись Inctagram или доступ к платформе в случае нарушения правил использования`,
  },
]
