export const ruTextsPrivacyPolicy = [
  `
Добро пожаловать на Inctagram, социальную платформу, ценящую вашу конфиденциальность и безопасность данных. Настоящая Политика конфиденциальности описывает наше обязательство по защите ваших личных данных и объясняет, как мы собираем, используем и обеспечиваем безопасность ваших данных.
`,
  `
Мы собираем следующие виды информации:
 Информацию, которую вы предоставляете при регистрации, такую как ваше имя, адрес электронной почты и дата рождения.

 Контент, который вы публикуете, включая фотографии, видео и сообщения.

 Информацию о том, как вы используете Inctagram, включая ваши взаимодействия с другими пользователями и контентом, который вы просматриваете.

Информацию об устройствах, которые вы используете для доступа к Inctagram, включая тип устройства, операционную систему и уникальные идентификаторы устройств.

 Если вы включите службы местоположения, мы можем собирать точное или приблизительное местоположение.

 Мы используем куки и аналогичные технологии для отслеживания вашего использования Inctagram и сбора данных о ваших взаимодействиях.
`,
  `
Мы используем вашу информацию для следующих целей:

Предоставление, поддержание и улучшение Inctagram.
Настройка вашего опыта и контента, который вы видите.
Общение с вами и отправка важных обновлений.
Защита безопасности и целостности нашей платформы.
Соблюдение юридических и регуляторных требований.`,
  `
Мы можем предоставлять вашу информацию следующим лицам:
Другим пользователям Inctagram согласно вашим настройкам конфиденциальности.
Поставщикам сторонних услуг, которые помогают нам предоставлять наши услуги.
Личным правоохранительным органам и регулирующим органам, когда это необходимо.
`,
  `
Мы серьезно относимся к безопасности данных и принимаем меры для защиты ваших данных. Однако ни один метод передачи или хранения не может быть 100% безопасным. Мы не можем гарантировать безопасность ваших данных.
`,
  `
Вы можете управлять настройками конфиденциальности на Inctagram, включая то, кто видит ваш контент и может взаимодействовать с вами. Вы также можете отказаться от получения рекламных электронных писем.
`,
  `
Inctagram не предназначен для лиц младше 13 лет. Мы не собираем и не храним информацию о детях младше этого возраста.
`,
  `
Мы можем время от времени обновлять настоящую Политику конфиденциальности. Когда это происходит, мы уведомляем вас о изменениях через коммуникационные каналы Inctagram.
`,
  `
Если у вас есть вопросы или замечания относительно настоящей Политики конфиденциальности или ваших данных, пожалуйста, свяжитесь с нами по адресу [Ваша контактная информация].`,
]
