import { LangType } from './en'

export const ru: LangType = {
  home: {
    home: 'Главная',
    create: 'Создать',
    profile: 'Мой Профиль',
    messenger: 'Мессенджер',
    search: 'Поиск',
    statistics: 'Статистика',
    favorites: 'Избранное',
  },
  resend: {
    title: 'Срок действия ссылки для подтверждения электронной почты истек',
    message:
      'Видимо срок действия верификационной ссылки истек. Не беспокойтесь, мы можем отправить Вам ссылку заново',
    resend_link: 'Переслать верификационную ссылку',
  },
  signup_confirm: {
    congratulations: 'Поздравляем!',
    confirmed: 'Ваша регистрация подтверждена',
    sign_in: 'Войти',
  },
  signin: {
    title: 'Войти',
    email: 'Электронная почта',
    password: 'Пароль',
    forgot_password: 'Забыли пароль',
    sign_in: 'Войти',
    sign_up: 'Зарегистрироваться',
    account_question: 'Вы не зарегистрированы?',
    error_message: 'Неверная почта или пароль. Попробуйте еще раз',
    email_required: 'Введите почту',
    password_required: 'Введите пароль',
  },
  signup: {
    title: 'Регистрация',
    email: 'Электронная почта',
    password: 'Пароль',
    password_confirmation: 'Подтверждение пароля',
    forgot_password: 'Forgot Password',
    sign_in: 'Войти',
    sign_up: 'Зарегистрироваться',
    account_question: 'Вы зарегистрированы?',
    agreement: 'Я соглашаюсь с ',
    and: 'и',
    terms_service: 'Условиями обслуживания',
    privacy_policy: 'Политикой конфиденциальности',
    username: 'Имя пользователя',
    username_required: 'Введите имя пользователя',
    user_exist_error: 'Пользователь с такой эл. почтой уже существует',
    email_required: 'Введите почту',
    password_required: 'Введите пароль',
    email_invalid: 'Почта недействительна',
    minPasswordLength: 'Минимальное количество знаков 6',
  },

  forgotpassword: {
    title: 'Забыли пароль',
    email: 'Электронная почта',
    message: 'Введите адрес электронной почты и получите дальнейшие инструкции',
    send_link: 'Отправить ссылку',
    back_signin: 'Вернуться ко Входу в приложение',
    checkbox_text: 'Я не робот',
    lg: 'ru',
  },
  email: {
    title: 'Письмо отправлено',
    message: 'Вам отправлена ссылка для подтверждения по адресу: ',
    yes: 'ОК',
  },

  logout: {
    title: 'Выход',
    message: 'Вы действительно хотите выйти из аккаунта ',
    yes: 'Да',
    no: 'Нет',
  },

  password_recovery: {
    title: 'Создать новый пароль',
    message: 'Пароль должен быть более 5 и менее 20 букв',
  },
  terms_of_service: {
    button_text: 'Вернуться к регистрации',
    title: 'Условия использования',
    text: `1. Используя Inctagram (далее Приложение), вы соглашаетесь соблюдать и подчиняться настоящим Условиям использования. Если вы не согласны с этими условиями, пожалуйста, не используйте Приложение. 
   
2. Право на использование Приложения:
   Для использования Приложения вы должны быть не моложе 13 лет. Используя Приложение, вы подтверждаете и гарантируете, что cоответствуйте этому требованию.

3. Учетные записи пользователей:
   Вы несете ответственность за обеспечение конфиденциальности учетных данных вашей учетной записи Instagram. Вы не можете делиться учетными данными Inctagram с другими или разрешать другим использовать вашу учетную запись. Вы несете ответственность за все действия, совершенные с использованием вашей учетной записи Inctagram.

4. Пользовательский контент:
   Вы несете полную ответственность за контент, который вы публикуете в Inctagram. Не размещайте контент, который является незаконным, агрессивным, домогательным, клеветническим или иным образом недопустимым. Вы предоставляете нам неисключительную, передаваемую, сублицензируемую, безвозмездную, мировую лицензию на использование вашего контента в связи с работой Instagram. Мы оставляем за собой право удалить или отключить любой контент, который нарушает настоящие условия.

5. Конфиденциальность и сбор данных:
   Наша Политика конфиденциальности, доступная по [ссылке на Политику конфиденциальности Inctagram], объясняет, как мы собираем, используем и защищаем ваши данные. Используя Instagram, вы соглашаетесь с условиями Политики конфиденциальности.

6. Поведение пользователей:
   Вы соглашаетесь не совершать действий, мешающих нормальной работе Inctagram или опыту других пользователей. Не используйте Inctagram для незаконных целей.

7. Меры безопасности:
   Мы предоставляем механизмы для сообщения о недопустимом контенте или поведении пользователей. Вы можете блокировать или сообщать о других пользователях Inctagram по мере необходимости для обеспечения вашего безопасного опыта.

8. Коммуникационные функции:
   Используйте коммуникационные функции Inctagram ответственно и уважайте права и конфиденциальность других пользователей. Не совершайте спам, домогательства или преследования в Inctagram.

9. Ссылки на сторонние ресурсы и сервисы:
   Inctagram может содержать ссылки на сторонние веб-сайты или сервисы. Inctagram не несет ответственности за содержание или практики этих внешних ресурсов или сервисов.

10. Интеллектуальная собственность:
    Весь контент и товарные знаки на Inctagram являются собственностью Inctagram. Если вы считаете, что ваше авторское право нарушено, пожалуйста, следуйте Политике по борьбе с нарушениями авторских прав Inctagram.

11. Отказ от гарантий:
    Inctagram предоставляется как есть без каких-либо гарантий. Inctagram не несет ответственности за прерывания, ошибки или упущения на платформе.

12. Прекращение использования:
    Inctagram оставляет за собой право прекратить или приостановить вашу учетную запись Inctagram или доступ к платформе в случае нарушения правил использования`,
  },
}
